Revit 2027 API
JournalingAttribute.Mode Property
Journaling mode.
Namespace: Autodesk.Revit.Attributes
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public JournalingMode Mode { get; }
Public ReadOnly Property Mode As JournalingMode
	Get
public:
property JournalingMode Mode {
	JournalingMode get ();
}
member Mode : JournalingMode with get
Property Value
JournalingMode
See Also
Reference
JournalingAttribute Class
Autodesk.Revit.Attributes Namespace